In [1]:
import pandas as pd 
import sqlite3

In [92]:
path_data = "D:\\Pavel_Homework\\HW_SQL\\bank_account_data.csv"

In [93]:
df_data = pd.read_csv(path_data, sep=';')

In [94]:
df_data

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,1,0,"1739,48","26918,18","12563,93",0,49,NaN
1,2,0,"2862,35","23093,67","15457,88",0,39,NaN
2,3,0,"2296,66","18037,33","12721,89",0,52,NaN
3,4,1,"2880,28","32317,63","7075,03",0,28,30.04.2017
4,5,0,"998,27","15110,04","11356,13",0,43,NaN
...,...,...,...,...,...,...,...,...
195,196,0,"2215,39","20050,87","11307,01",0,32,NaN
196,197,0,"2074,33","22808,68","7880,16",0,27,NaN
197,198,0,"1224,07","29926,97","5637,92",0,44,NaN
198,199,0,"2617,27","14316,61","9445,28",0,38,NaN
199,200,0,"2125,45","25687,52","4559,63",0,56,NaN

In [95]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cust_ID     200 non-null    int64
 1   Purchase    200 non-null    int64
 2   Cheq_Bal    200 non-null    object
 3   Sav_Bal     200 non-null    object
 4   Debt_Bal    200 non-null    object
 5   Joint_Acct  200 non-null    int64
 6   Age         200 non-null    int64
 7   Date        39 non-null     object
dtypes: int64(4), object(4)
memory usage: 12.6+ KB

# перевод чисел в float

In [96]:
for i in range(200):
    df_data.loc[i,"Cheq_Bal"] = float(df_data.loc[i,"Cheq_Bal"].replace(',','.'))
    df_data.loc[i,"Sav_Bal"] = float(df_data.loc[i,"Sav_Bal"].replace(',','.'))
    df_data.loc[i,"Debt_Bal"] = float(df_data.loc[i,"Debt_Bal"].replace(',','.'))

In [97]:
df_data["Cheq_Bal"] = pd.to_numeric(df_data["Cheq_Bal"])
df_data["Sav_Bal"] = pd.to_numeric(df_data["Sav_Bal"])
df_data["Debt_Bal"] = pd.to_numeric(df_data["Debt_Bal"])

In [98]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cust_ID     200 non-null    int64
 1   Purchase    200 non-null    int64
 2   Cheq_Bal    200 non-null    float64
 3   Sav_Bal     200 non-null    float64
 4   Debt_Bal    200 non-null    float64
 5   Joint_Acct  200 non-null    int64
 6   Age         200 non-null    int64
 7   Date        39 non-null     object
dtypes: float64(3), int64(4), object(1)
memory usage: 12.6+ KB

In [99]:
df_data.describe()

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,0.195000,2145.093500,22084.428950,8638.369600,0.295000,38.535000
std,57.879185,0.397195,652.712779,6048.106705,5280.852405,0.457187,11.336284
min,1.000000,0.000000,644.310000,6558.910000,0.000000,0.000000,18.000000
25%,50.750000,0.000000,1720.077500,18079.045000,4608.445000,0.000000,31.000000
50%,100.500000,0.000000,2108.125000,21374.210000,8272.175000,0.000000,37.000000
75%,150.250000,0.000000,2522.927500,25722.047500,12725.722500,1.000000,47.000000
max,200.000000,1.000000,4437.440000,39132.630000,20559.700000,1.000000,60.000000

# Подключение БД

In [100]:
# create database
сonnect  = sqlite3.connect('database.db')
c = сonnect.cursor()

In [102]:
# создание таблицы 
c.execute('CREATE TABLE IF NOT EXISTS data (Cust_ID, Purchase, Cheq_Bal, Sav_Bal, Debt_Bal , Joint_Acct, Age , Date )')
df_data.to_sql('data', conn, if_exists='replace', index = False)

200

In [103]:
c.execute("PRAGMA table_info(data)")
data = c.fetchmany(8)

In [104]:
data

[(0, 'Cust_ID', 'INTEGER', 0, None, 0),
 (1, 'Purchase', 'INTEGER', 0, None, 0),
 (2, 'Cheq_Bal', 'REAL', 0, None, 0),
 (3, 'Sav_Bal', 'REAL', 0, None, 0),
 (4, 'Debt_Bal', 'REAL', 0, None, 0),
 (5, 'Joint_Acct', 'INTEGER', 0, None, 0),
 (6, 'Age', 'INTEGER', 0, None, 0),
 (7, 'Date', 'TEXT', 0, None, 0)]

Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок.

In [106]:
def calculate_describe_sql(conn):
    conn.execute("PRAGMA table_info(data)")
    data_columns = c.fetchmany(8)
    list_name_columns = ['count', 'avg', 'max', 'min']
    list_name = []
    list_count = []
    list_avg = []
    list_max = []
    list_min= []
    for column in data_columns:
        list_name.append(column[1])
        # count
        conn.execute(f"SELECT COUNT({column[1]}) FROM data")
        list_count.append(conn.fetchmany(1))
        # avg
        conn.execute(f"SELECT AVG({column[1]}) FROM data")
        list_avg.append(conn.fetchmany(1))
        # max 
        conn.execute(f"SELECT MAX({column[1]}) FROM data")
        list_max.append(conn.fetchmany(1))
        # min
        conn.execute(f"SELECT MIN({column[1]}) FROM data")
        list_min.append(conn.fetchmany(1))

    list_data = [list_count, list_avg, list_max, list_min]
    print("   ", end=" ")
    for i in range(len(list_name)):
        print(list_name[i], end=" ") 
    print()
    for j in range(len(list_name_columns)):
        print(list_name_columns[j], end=" ")
        for i in range(len(list_name)):
            print(list_data[j][i][0][0], end=" ")
        print()

In [107]:
calculate_describe_sql(c)

    Cust_ID Purchase Cheq_Bal Sav_Bal Debt_Bal Joint_Acct Age Date
count 200 200 200 200 200 200 200 39
avg 100.5 0.195 2145.0935000000004 22084.428949999987 8638.3696 0.295 38.535 16.008974358974356
max 200 1 4437.44 39132.63 20559.7 1 60 30.05.2017
min 1 0 644.31 6558.91 0.0 0 18 01.04.2017

Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам.

In [125]:
def calculate_balance(conn):
    conn.execute("SELECT COUNT(Cheq_Bal) FROM data")
    conn.execute("SELECT Cust_ID, (Cheq_Bal+Sav_Bal+Debt_Bal) AS balance FROM data ")
    сonnect.commit()
    print("Запись успешно обновлена")
    ss = conn.fetchall()
    for i in ss:
        print("Cust_ID:", i[0], " sum_balance:", i[1])

In [126]:
calculate_balance(c)

Запись успешно обновлена
Cust_ID: 1  sum_balance: 41221.59
Cust_ID: 2  sum_balance: 41413.899999999994
Cust_ID: 3  sum_balance: 33055.880000000005
Cust_ID: 4  sum_balance: 42272.94
Cust_ID: 5  sum_balance: 27464.440000000002
Cust_ID: 6  sum_balance: 41838.280000000006
Cust_ID: 7  sum_balance: 29915.27
Cust_ID: 8  sum_balance: 26400.71
Cust_ID: 9  sum_balance: 51973.18
Cust_ID: 10  sum_balance: 30965.510000000002
Cust_ID: 11  sum_balance: 38132.88
Cust_ID: 12  sum_balance: 43615.76
Cust_ID: 13  sum_balance: 28965.989999999998
Cust_ID: 14  sum_balance: 34723.399999999994
Cust_ID: 15  sum_balance: 33394.45
Cust_ID: 16  sum_balance: 33410.5
Cust_ID: 17  sum_balance: 39208.030000000006
Cust_ID: 18  sum_balance: 36566.619999999995
Cust_ID: 19  sum_balance: 31412.699999999997
Cust_ID: 20  sum_balance: 29944.98
Cust_ID: 21  sum_balance: 16621.58
Cust_ID: 22  sum_balance: 43763.35999999999
Cust_ID: 23  sum_balance: 41000.759999999995
Cust_ID: 24  sum_balance: 35033.89
Cust_ID: 25  sum_balance: 37658.87
Cust_ID: 26  sum_balance: 36597.9
Cust_ID: 27  sum_balance: 20303.280000000002
Cust_ID: 28  sum_balance: 37608.76
Cust_ID: 29  sum_balance: 33428.73
Cust_ID: 30  sum_balance: 16806.010000000002
Cust_ID: 31  sum_balance: 22830.14
Cust_ID: 32  sum_balance: 23578.079999999998
Cust_ID: 33  sum_balance: 43978.75
Cust_ID: 34  sum_balance: 31366.08
Cust_ID: 35  sum_balance: 38462.28
Cust_ID: 36  sum_balance: 35089.36
Cust_ID: 37  sum_balance: 28494.54
Cust_ID: 38  sum_balance: 24674.59
Cust_ID: 39  sum_balance: 27133.739999999998
Cust_ID: 40  sum_balance: 43671.2
Cust_ID: 41  sum_balance: 34262.72
Cust_ID: 42  sum_balance: 37492.09
Cust_ID: 43  sum_balance: 35805.83
Cust_ID: 44  sum_balance: 36323.68
Cust_ID: 45  sum_balance: 23271.79
Cust_ID: 46  sum_balance: 28802.08
Cust_ID: 47  sum_balance: 34586.07000000001
Cust_ID: 48  sum_balance: 27015.409999999996
Cust_ID: 49  sum_balance: 34820.350000000006
Cust_ID: 50  sum_balance: 15987.57
Cust_ID: 51  sum_balance: 30261.550000000003
Cust_ID: 52  sum_balance: 27428.53
Cust_ID: 53  sum_balance: 28945.909999999996
Cust_ID: 54  sum_balance: 43562.82
Cust_ID: 55  sum_balance: 37085.06
Cust_ID: 56  sum_balance: 38949.97
Cust_ID: 57  sum_balance: 32198.39
Cust_ID: 58  sum_balance: 31658.410000000003
Cust_ID: 59  sum_balance: 39350.42
Cust_ID: 60  sum_balance: 32417.27
Cust_ID: 61  sum_balance: 33326.380000000005
Cust_ID: 62  sum_balance: 35482.69
Cust_ID: 63  sum_balance: 42816.03
Cust_ID: 64  sum_balance: 25898.920000000002
Cust_ID: 65  sum_balance: 37290.09
Cust_ID: 66  sum_balance: 26233.949999999997
Cust_ID: 67  sum_balance: 29766.050000000003
Cust_ID: 68  sum_balance: 43735.55
Cust_ID: 69  sum_balance: 32492.949999999997
Cust_ID: 70  sum_balance: 27780.369999999995
Cust_ID: 71  sum_balance: 18320.079999999998
Cust_ID: 72  sum_balance: 32272.260000000002
Cust_ID: 73  sum_balance: 41285.11
Cust_ID: 74  sum_balance: 35751.509999999995
Cust_ID: 75  sum_balance: 38323.8
Cust_ID: 76  sum_balance: 36686.9
Cust_ID: 77  sum_balance: 37178.22
Cust_ID: 78  sum_balance: 38179.22
Cust_ID: 79  sum_balance: 21233.91
Cust_ID: 80  sum_balance: 39748.909999999996
Cust_ID: 81  sum_balance: 34516.24
Cust_ID: 82  sum_balance: 28567.600000000002
Cust_ID: 83  sum_balance: 21019.95
Cust_ID: 84  sum_balance: 35021.11
Cust_ID: 85  sum_balance: 33171.09
Cust_ID: 86  sum_balance: 19900.05
Cust_ID: 87  sum_balance: 36492.840000000004
Cust_ID: 88  sum_balance: 28222.059999999998
Cust_ID: 89  sum_balance: 28145.48
Cust_ID: 90  sum_balance: 32551.83
Cust_ID: 91  sum_balance: 35935.41
Cust_ID: 92  sum_balance: 24463.56
Cust_ID: 93  sum_balance: 42296.27
Cust_ID: 94  sum_balance: 36198.11
Cust_ID: 95  sum_balance: 30839.850000000002
Cust_ID: 96  sum_balance: 25808.260000000002
Cust_ID: 97  sum_balance: 36387.7
Cust_ID: 98  sum_balance: 28905.18
Cust_ID: 99  sum_balance: 29658.18
Cust_ID: 100  sum_balance: 27718.12
Cust_ID: 101  sum_balance: 29509.28
Cust_ID: 102  sum_balance: 25973.47
Cust_ID: 103  sum_balance: 32851.68
Cust_ID: 104  sum_balance: 39936.9
Cust_ID: 105  sum_balance: 32039.37
Cust_ID: 106  sum_balance: 39545.909999999996
Cust_ID: 107  sum_balance: 29282.489999999998
Cust_ID: 108  sum_balance: 40096.47
Cust_ID: 109  sum_balance: 26457.0
Cust_ID: 110  sum_balance: 36038.95
Cust_ID: 111  sum_balance: 39336.13
Cust_ID: 112  sum_balance: 27992.83
Cust_ID: 113  sum_balance: 31944.739999999998
Cust_ID: 114  sum_balance: 33039.48
Cust_ID: 115  sum_balance: 32863.71
Cust_ID: 116  sum_balance: 26536.83
Cust_ID: 117  sum_balance: 35882.32
Cust_ID: 118  sum_balance: 25186.63
Cust_ID: 119  sum_balance: 36488.17
Cust_ID: 120  sum_balance: 30897.48
Cust_ID: 121  sum_balance: 20758.530000000002
Cust_ID: 122  sum_balance: 24076.059999999998
Cust_ID: 123  sum_balance: 33874.33
Cust_ID: 124  sum_balance: 35604.61
Cust_ID: 125  sum_balance: 35488.74
Cust_ID: 126  sum_balance: 35645.82
Cust_ID: 127  sum_balance: 36908.05
Cust_ID: 128  sum_balance: 37430.33
Cust_ID: 129  sum_balance: 32038.15
Cust_ID: 130  sum_balance: 19324.98
Cust_ID: 131  sum_balance: 36414.68
Cust_ID: 132  sum_balance: 56297.509999999995
Cust_ID: 133  sum_balance: 26346.82
Cust_ID: 134  sum_balance: 25031.299999999996
Cust_ID: 135  sum_balance: 48689.479999999996
Cust_ID: 136  sum_balance: 34816.520000000004
Cust_ID: 137  sum_balance: 34788.08
Cust_ID: 138  sum_balance: 34746.06
Cust_ID: 139  sum_balance: 34422.26
Cust_ID: 140  sum_balance: 29653.620000000003
Cust_ID: 141  sum_balance: 25731.18
Cust_ID: 142  sum_balance: 30643.42
Cust_ID: 143  sum_balance: 25136.54
Cust_ID: 144  sum_balance: 36362.25
Cust_ID: 145  sum_balance: 37188.149999999994
Cust_ID: 146  sum_balance: 38210.28
Cust_ID: 147  sum_balance: 34430.31
Cust_ID: 148  sum_balance: 37307.619999999995
Cust_ID: 149  sum_balance: 32727.18
Cust_ID: 150  sum_balance: 34688.380000000005
Cust_ID: 151  sum_balance: 28970.25
Cust_ID: 152  sum_balance: 46599.270000000004
Cust_ID: 153  sum_balance: 30962.29
Cust_ID: 154  sum_balance: 36663.549999999996
Cust_ID: 155  sum_balance: 29369.39
Cust_ID: 156  sum_balance: 31721.07
Cust_ID: 157  sum_balance: 39017.619999999995
Cust_ID: 158  sum_balance: 26943.88
Cust_ID: 159  sum_balance: 20443.76
Cust_ID: 160  sum_balance: 38166.64
Cust_ID: 161  sum_balance: 30843.82
Cust_ID: 162  sum_balance: 28747.01
Cust_ID: 163  sum_balance: 34129.270000000004
Cust_ID: 164  sum_balance: 22190.9
Cust_ID: 165  sum_balance: 23232.98
Cust_ID: 166  sum_balance: 34450.56
Cust_ID: 167  sum_balance: 32632.590000000004
Cust_ID: 168  sum_balance: 32017.36
Cust_ID: 169  sum_balance: 28944.559999999998
Cust_ID: 170  sum_balance: 38360.62
Cust_ID: 171  sum_balance: 24459.42
Cust_ID: 172  sum_balance: 29759.03
Cust_ID: 173  sum_balance: 49070.600000000006
Cust_ID: 174  sum_balance: 32203.02
Cust_ID: 175  sum_balance: 37420.71
Cust_ID: 176  sum_balance: 23457.6
Cust_ID: 177  sum_balance: 38347.74
Cust_ID: 178  sum_balance: 33120.35
Cust_ID: 179  sum_balance: 24714.129999999997
Cust_ID: 180  sum_balance: 33877.26
Cust_ID: 181  sum_balance: 38312.08
Cust_ID: 182  sum_balance: 39206.16999999999
Cust_ID: 183  sum_balance: 39404.270000000004
Cust_ID: 184  sum_balance: 31366.030000000002
Cust_ID: 185  sum_balance: 34242.6
Cust_ID: 186  sum_balance: 28140.09
Cust_ID: 187  sum_balance: 22496.879999999997
Cust_ID: 188  sum_balance: 28439.579999999998
Cust_ID: 189  sum_balance: 33563.69
Cust_ID: 190  sum_balance: 41777.07
Cust_ID: 191  sum_balance: 37666.64
Cust_ID: 192  sum_balance: 21765.809999999998
Cust_ID: 193  sum_balance: 26886.16
Cust_ID: 194  sum_balance: 37870.32
Cust_ID: 195  sum_balance: 39198.909999999996
Cust_ID: 196  sum_balance: 33573.27
Cust_ID: 197  sum_balance: 32763.170000000002
Cust_ID: 198  sum_balance: 36788.96
Cust_ID: 199  sum_balance: 26379.160000000003
Cust_ID: 200  sum_balance: 32372.600000000002

Выведите только тех клиентов, которые приобрели ипотеку (колонка mortgage).

In [138]:
def view_ipot(conn):
    conn.execute("SELECT COUNT(Cheq_Bal) FROM data")
    conn.execute("SELECT Cust_ID, Date AS mortgage FROM data WHERE Date != 'None'")
    сonnect.commit()
    print("Запись успешно обновлена")
    ss = conn.fetchall()
    for i in ss:
        print("Cust_ID:", i[0], " data mortgage:", i[1])

In [139]:
view_ipot(c)

Запись успешно обновлена
Cust_ID: 4  data mortgage: 30.04.2017
Cust_ID: 6  data mortgage: 30.05.2017
Cust_ID: 7  data mortgage: 13.08.2017
Cust_ID: 11  data mortgage: 16.05.2017
Cust_ID: 13  data mortgage: 07.07.2017
Cust_ID: 17  data mortgage: 29.06.2017
Cust_ID: 18  data mortgage: 29.08.2017
Cust_ID: 20  data mortgage: 22.07.2017
Cust_ID: 22  data mortgage: 04.04.2017
Cust_ID: 31  data mortgage: 30.05.2017
Cust_ID: 36  data mortgage: 22.04.2017
Cust_ID: 38  data mortgage: 09.08.2017
Cust_ID: 40  data mortgage: 11.07.2017
Cust_ID: 41  data mortgage: 25.08.2017
Cust_ID: 54  data mortgage: 15.04.2017
Cust_ID: 56  data mortgage: 29.05.2017
Cust_ID: 59  data mortgage: 19.05.2017
Cust_ID: 60  data mortgage: 19.04.2017
Cust_ID: 74  data mortgage: 29.07.2017
Cust_ID: 76  data mortgage: 23.04.2017
Cust_ID: 80  data mortgage: 09.07.2017
Cust_ID: 87  data mortgage: 25.04.2017
Cust_ID: 91  data mortgage: 05.07.2017
Cust_ID: 93  data mortgage: 12.04.2017
Cust_ID: 94  data mortgage: 17.08.2017
Cust_ID: 97  data mortgage: 13.07.2017
Cust_ID: 100  data mortgage: 02.07.2017
Cust_ID: 107  data mortgage: 15.08.2017
Cust_ID: 111  data mortgage: 19.06.2017
Cust_ID: 113  data mortgage: 08.06.2017
Cust_ID: 132  data mortgage: 01.08.2017
Cust_ID: 146  data mortgage: 02.07.2017
Cust_ID: 154  data mortgage: 14.08.2017
Cust_ID: 166  data mortgage: 28.05.2017
Cust_ID: 169  data mortgage: 19.06.2017
Cust_ID: 182  data mortgage: 03.05.2017
Cust_ID: 184  data mortgage: 15.06.2017
Cust_ID: 185  data mortgage: 01.04.2017
Cust_ID: 189  data mortgage: 03.07.2017

Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [169]:
def comparison(conn):
    conn.execute("SELECT COUNT(Cheq_Bal) FROM data")
    conn.execute("SELECT SUM(Cheq_Bal+Sav_Bal+Debt_Bal) AS balance FROM data WHERE Date != 'None'")
    сonnect.commit()
    print("Запись успешно обновлена")
    balance_with_ipot = conn.fetchall()[0][0]
    conn.execute("SELECT SUM(Cheq_Bal+Sav_Bal+Debt_Bal) AS balance FROM data ")
    сonnect.commit()
    print("Запись успешно обновлена")
    balance_without_ipot = conn.fetchall()[0][0] - balance_with_ipot

    print("with mortgage",balance_with_ipot,"\n" "without mortgage",balance_without_ipot)

In [170]:
comparison(c)

Запись успешно обновлена
Запись успешно обновлена
with mortgage 1406140.9200000002
without mortgage 5167437.4899999965

Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [183]:
def check_avg(conn):
    # conn.execute("SELECT COUNT(Cheq_Bal) FROM data")
    conn.execute("SELECT AVG(Cheq_Bal), AVG(Sav_Bal), AVG(Debt_Bal) AS balance FROM data WHERE Date != 'None'")
    avg_params_with = conn.fetchall()
    conn.execute("SELECT AVG(Cheq_Bal), AVG(Sav_Bal), AVG(Debt_Bal) AS balance FROM data WHERE Date IS NULL")
    avg_params_without = conn.fetchall()
    print("with mortgage")
    for items in avg_params_with:
        print("Cheq_Bal_AVG:",items[0], 'Sav_Bal_AVG:', items[1], 'Debt_Bal:', items[2] )
    print("without mortgage")
    for items in avg_params_without:
        print("Cheq_Bal_AVG:",items[0], 'Sav_Bal_AVG:', items[1], 'Debt_Bal:', items[2] ) 
    print('difference')
    for i in range(len(avg_params_without)):
        print("Cheq_Bal_AVG:",avg_params_with[0][0] - avg_params_without[0][0], 'Sav_Bal_AVG:', avg_params_with[0][1]- avg_params_without[0][1], 'Debt_Bal:', avg_params_with[0][2]-avg_params_without[0][2] )

In [184]:
check_avg(c)

with mortgage
Cheq_Bal_AVG: 2757.975641025641 Sav_Bal_AVG: 29627.56435897436 Debt_Bal: 3669.355384615386
without mortgage
Cheq_Bal_AVG: 1996.6313664596285 Sav_Bal_AVG: 20257.209813664605 Debt_Bal: 9842.043850931674
difference
Cheq_Bal_AVG: 761.3442745660125 Sav_Bal_AVG: 9370.354545309754 Debt_Bal: -6172.688466316287

Выберите самого возрастного получателя ипотеки.

In [189]:
def max_age(conn):
    conn.execute("SELECT *  FROM data WHERE Age = (SELECT MAX(Age) FROM data)")
    data = conn.fetchall()
    for i in data:
        print(i)

In [190]:
max_age(c)

(34, 0, 2109.47, 24618.52, 4638.09, 0, 60, None)
(47, 0, 2462.42, 18250.63, 13873.02, 1, 60, None)
(148, 0, 1739.48, 18678.09, 16890.05, 0, 60, None)
(176, 0, 1409.93, 22047.67, 0.0, 1, 60, None)

Выберите клиента, который раньше всех получил ипотеку.

In [196]:
def early_date(conn):
    conn.execute("SELECT *  FROM data WHERE Date = (SELECT MIN(Date) FROM data)")
    data = conn.fetchall()
    for i in data:
        print(i)

In [197]:
early_date(c)

(185, 1, 1759.04, 29198.17, 3285.39, 1, 36, '01.04.2017')

# СОЗДАНИЕ ТАБЛИЦЫ

Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [202]:
c.execute('CREATE TABLE IF NOT EXISTS new_table (Cust_ID INTEGER, Anime TEXT, Age INTEGER, Сoefficient_like REAL, Сoefficient_rate REAL )')

Добавьте 3 полностью заполненные строки в вашу БД.

In [212]:
c.execute("INSERT INTO new_table (Cust_ID, Anime, Age, Сoefficient_like, Сoefficient_rate ) VALUES (1, 'A', 26, 21.4, 25.6)")
c.execute("INSERT INTO new_table (Cust_ID, Anime, Age, Сoefficient_like, Сoefficient_rate ) VALUES (2, 'B', 21, 100.1, 10.6)")
c.execute("INSERT INTO new_table (Cust_ID, Anime, Age, Сoefficient_like, Сoefficient_rate ) VALUES (3, 'C', 99, 0.4, 0.6)")
сonnect.commit()

Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.

In [213]:
c.execute("DELETE FROM new_table WHERE Сoefficient_like = (SELECT MIN(Сoefficient_like) FROM new_table) AND (SELECT MAX(Сoefficient_like) FROM new_table)")

In [214]:
сonnect.commit()